---
kind: method
id: M:Autodesk.Revit.DB.FailureHandlingOptions.Dispose
source: html/6403f6f5-9c9b-e92f-36eb-e5a9599d32f3.htm
---
# Autodesk.Revit.DB.FailureHandlingOptions.Dispose Method

Releases all resources used by the FailureHandlingOptions

## Syntax (C#)
```csharp
public void Dispose()
```